# Final Exam

* Many-to-many relationships

* Joining tables

* Nested queries

## Quiz 2

In [1]:
from reframe import Relation

place = Relation('/home/faculty/yasiro01/pub/place.csv', sep=',')
animal = Relation('/home/faculty/yasiro01/pub/zoo.csv', sep=',')

In [9]:
import pandas as pd
from sqlalchemy import create_engine

# Uncomment these lines to create a table in **your** database

#conn = create_engine('postgresql://yasiro01@localhost/yasiro01')
#pd.read_csv('/home/faculty/yasiro01/pub/animal.csv', sep=',').to_sql('animal', conn)
#pd.read_csv('/home/faculty/yasiro01/pub/place.csv', sep=',').to_sql('place', conn)

In [4]:
%load_ext sql

In [5]:
%sql postgresql://yasiro01:@localhost/yasiro01

'Connected: yasiro01@yasiro01'

### Draw a table resulting from the following query:
```
select animal.name, species, place.location
from animal natural join place
where species = 'Newt'
order by place.name;
```

In [40]:
%%sql

select animal.name, species, place.location
from animal natural join place
where species = 'Newt'
order by name;

1 rows affected.

[('Wind', 'Newt', 'Basement')]

### Write a SQL query that finds all animals residing in winter locations.

In [10]:
%%sql

select *
from animal natural join place
where season = 'Winter';

1 rows affected.

[(0, 1, 'Attic', 'Chunk', 34, 'Jaguar', 5, 'Winter')]

In [12]:
%%sql

select *
from animal natural join place;

2 rows affected.

[(0, 1, 'Attic', 'Chunk', 34, 'Jaguar', 5, 'Winter'),
 (1, 2, 'Basement', 'Wind', 99, 'Newt', 6, 'Summer')]

In [13]:
%%sql

select *
from animal join place on animal.location = place.location
where season = 'Winter';

3 rows affected.

[(0, 1, 'Chunk', 34, 'Jaguar', 'Attic', 0, 1, 'Attic', 5, 'Winter'),
 (4, 5, 'Wild Isotope', 28, 'Humboldt Penguin', 'Attic', 0, 1, 'Attic', 5, 'Winter'),
 (9, 10, 'Thunder', 38, 'Jaguar', 'Attic', 0, 1, 'Attic', 5, 'Winter')]

### Write a relational algebra query that finds all animals residing in winter locations.

In [46]:
animal.njoin(place).query('season == "Winter"')

   id   name  age species location  capacity  season
0   1  Chunk   34  Jaguar    Attic         5  Winter

In [47]:
animal.rename('id', 'a_id').njoin(place).query('season == "Winter"')

   a_id          name  age           species location  id  capacity  season
0     1         Chunk   34            Jaguar    Attic   1         5  Winter
1     5  Wild Isotope   28  Humboldt Penguin    Attic   1         5  Winter
2    10       Thunder   38            Jaguar    Attic   1         5  Winter

### Write a SQL query that finds all locations filled at 50% (or more) of their capacity.

In [16]:
%%sql

select location, count(*) pop
from animal
group by location;

4 rows affected.

[('Garage', 2), ('Back yard', 2), ('Basement', 3), ('Attic', 3)]

In [34]:
%%sql

select location, pop, capacity, to_char(pop::decimal/capacity*100, '999.99%') as used
from (
    select location, count(*) pop
    from animal
    group by location
) as p natural join place
where pop::decimal/capacity >= 0.5

2 rows affected.

[('Attic', 3, 5, '  60.00%'), ('Basement', 3, 6, '  50.00%')]